## Plan Result (prod_app_registrations)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Heritage-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/SDS-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/SDS-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Security&#34;]
* Delete
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application_federated_identity_credential.this["DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing"] will be destroyed
  # (because key ["DTS Orphaned Resource Cleanup-repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "this" {
      - application_object_id = "6a17262e-a18a-4bc2-b774-7411dfdd68fe" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "151692c0-2d32-46fa-af3d-7aa66aac15f3" -> null
      - display_name          = "repo_hmcts__dtspo-orphan-resources-cleanup_ref_refs__heads__dxw__orphan-testing" -> null
      - id                    = "6a17262e-a18a-4bc2-b774-7411dfdd68fe/federatedIdentityCredential/151692c0-2d32-46fa-af3d-7aa66aac15f3" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:hmcts/dtspo-orphan-resources-cleanup:ref:refs/heads/dxw/orphan-testing" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod"] will be destroyed
  # (because key ["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/cf34595b-cd4b-b445-b001-4035213de87c" -> null
      - name                 = "cf34595b-cd4b-b445-b001-4035213de87c" -> null
      - principal_id         = "50cce126-c44a-48bb-9361-5f55868d3182" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/02e598af-dab5-5dba-d4f2-dbef1f5b734a" -> null
      - role_definition_name = "Orphan Resource Cleanup Read/Delete" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Platform-Prod" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Security"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50cce126-c44a-48bb-9361-5f55868d3182"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":50,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->